import matplotlib.pyplot as plt
x = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]
y1 = [157.23, 612.97, 1374.99, 2507.02, 4008.21, 5551.08, 7500.38, 9882.73, 12421.61, 15734.22]
y2 = [83.12, 304.38, 676.97, 1214.04, 1886.02, 2693.51, 3699.44, 4779.46, 6048.37, 7444.49]
y3 = [20.57, 39.54, 72.96, 88.86, 114.04, 139.11, 164.76, 188.68, 214.69, 241.19]
# Построение графика
plt.plot(x, y1, label = "Bubble sort")
plt.plot(x, y2, label = "Select sort")
plt.plot(x, y3, label = "Quick sort")
plt.legend()
plt.show()
